---
type: CorrectionFactorSetIterator
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 4
tags: [revit-api, class]
---

# CorrectionFactorSetIterator

`Autodesk.Revit.DB.Electrical.CorrectionFactorSetIterator` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CorrectionFactorSetIterator | — | `public CorrectionFactorSetIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |